![New York City schoolbus](..\images\schoolbus.jpg)

Photo by [Jannis Lucas](https://unsplash.com/@jannis_lucas) on [Unsplash](https://unsplash.com).
<br>

Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a maximum score of 800 points. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. 

You have been provided with a dataset called `schools.csv`, which is previewed below.

You have been tasked with answering three key questions about New York City (NYC) public school SAT performance.

In [1]:
# Re-run this cell 
import pandas as pd

# Read in the data
schools = pd.read_csv("..\dataset\schools.csv")

In [2]:
# Preview the data
schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

In [3]:
# find best maths school with avaerage maths score greater than equals to 640
best_math_schools = schools[schools['average_math']>=640].sort_values(by="average_math",ascending=False)[['school_name','average_math']]
best_math_schools

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683
280                     Brooklyn Technical High School           682
333                        Townsend Harris High School           680
174  High School of American Studies at Lehman College           669
0    New Explorations into Science, Technology and ...           657
45                       Eleanor Roosevelt High School           641

In [4]:
# introducing new column total SAT score sum of score of each column row wise
schools['total_SAT'] = schools[['average_math','average_reading','average_writing']].sum(axis=1)
schools['total_SAT']

0      1859
1      1193
2      1261
3      1529
4      1197
       ...
370    1086
371    1114
372    1280
373    1207
374    1716
Name: total_SAT, Length: 375, dtype: int64

In [5]:
# creating a dataframe of  top 10 school with highest total Sat Score 
top_10_schools =schools[['school_name','total_SAT']].sort_values(by="total_SAT",ascending=False).iloc[:10]
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

In [6]:
#calculating count(num of school),average and standard deviation of total SAT score borough wise (round of to 2 decimal place)
largest_std_dev = schools.groupby('borough')['total_SAT'].agg(['count','mean','std']).round(2)
largest_std_dev

               count     mean     std
borough
Bronx             98  1202.72  150.39
Brooklyn         109  1230.26  154.87
Manhattan         89  1340.13  230.29
Queens            69  1345.48  195.25
Staten Island     10  1439.00  222.30

In [7]:
#filter dataset with hight standard deviation
largest_std_dev = largest_std_dev[largest_std_dev['std']==largest_std_dev['std'].max()]
largest_std_dev

           count     mean     std
borough
Manhattan     89  1340.13  230.29

In [8]:
#rename column (count = num of school in borough) (mean = avegage SAT score) (standard deviation = standard deviation of SAT score) 
largest_std_dev= largest_std_dev.rename(columns = {'count':'num_schools', 'mean':'average_SAT','std':'std_SAT'}) 
largest_std_dev

           num_schools  average_SAT  std_SAT
borough
Manhattan           89      1340.13   230.29